//cache优化算法
#include<iostream>
using namespace std;
int main()
{
	int arry[10][10] = { {7,10,3,10,8,6,3,7,1,10,},{7,9,2,4,1,10,2,9,8,9,},{10,2,7,4,8,9,9,9,8,1,},{4,2,7,1,7,4,1,6,2,10,},{1,10,8,4,7,9,2,6,9,10,},{4,2,4,4,4,7,3,6,2,4,},{4,10,7,5,3,7,6,1,6,7,},{8,9,10,1,9,9,8,3,5,9,},{10,6,10,5,2,3,3,4,2,2,},{7,7,10,10,10,3,3,3,1,5} };
	int a[10] = { 3,5,2,9,4,6,1,8,6,10 };
	int res[100];
	for (int i = 0; i < 10; i++)
	{
		res[i] = 0;
	}
	for (int i = 0; i < 10; i++)
	{

		for (int j = 0; j < 10; j++)
		{
			res[j] += arry[i][j] * a[i];
		}
	}
	cout << "矩阵的每一列与固定向量的乘积是：";
	for (int i = 0; i < 10; i++)
	{
		cout << res[i] << " ";
	}
	return 0;
}
//利用cache的优化算法，改变按列访问的平凡算法，变为按行访问，保证每个元素只被访问一次，减少读取时间