//相邻配对公约
#include<iostream>
using namespace std;
int next_match(int* arry, int n)
{
	for (int i = 1; i < n; i *= 2)
	{
		for (int j = 0; j < n; j++)
		{
			if (j % (i * 2) == 0)
			{
				if (j + i < n)
				{
					arry[j] += arry[j + i];
				}

			}
		}
	}
	return arry[0];
}
int main()
{
	int arry[100] = { 38,95,74,100,6,60,30,63,99,36,77,90,55,51,80,25,36,41,70,63,46,54,17,70,58,73,15,98,20,2,3,31,11,35,24,89,23,96,29,73,75,27,69,2,24,87,66,27,58,38,64,14,70,49,95,29,7,95,1,33,73,62,29,25,95,73,17,52,55,73,25,13,28,42,28,65,23,36,30,86,26,7,50,51,73,32,90,3,82,70,30,39,60,35,57,14,34,30,86,92 };

	cout << "100个数相加结果为：" << next_match(arry, 100);
	return 0;
}
//采用相邻配对原则就是说两两相加，一层层累加求和，并行求解
